Revit 2026 API

# SpaceActualOtherLoad Property

---

Get the Actual Other Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualOtherLoad { get; }
```
```vb
Public ReadOnly Property ActualOtherLoad As Double
	Get
```
```cpp
public:
property double ActualOtherLoad {
	double get ();
}
```
```fsharp
member ActualOtherLoad : float with get
```

#### Property Value

Double

This property is used to get the Actual Other Load (Unit: W) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace